Repository: Jeffneck/Transcendence
Catalog: pong_project/locale/*/LC_MESSAGES/django.po
Languages: es

source: Nom d'utilisateur
es: Nombre de usuario

source: Le nouveau nom d'utilisateur doit être différent de l'actuel.
es: El nuevo nombre de usuario debe ser diferente al actual.

source: Le nom d'utilisateur ne doit contenir que des lettres, chiffres et underscores.
es: El nombre de usuario solo debe contener letras, números y guiones bajos.

source: Ce nom d'utilisateur est déjà pris.
es: Este nombre de usuario ya está en uso.

source: Le nom d'utilisateur ne peut pas être vide.
es: El nombre de usuario no puede estar vacío.

source: Ancien mot de passe
es: Contraseña antigua

source: Nouveau mot de passe
es: Nueva contraseña

source: Confirmez le nouveau mot de passe
es: Confirma la nueva contraseña

source: Choisir un fichier
es: Elegir archivo

source: Aucun fichier n'a été téléchargé.
es: Ningún archivo ha sido subido.

source: L'image ne doit pas dépasser 4 Mo.
es: La imagen no debe exceder los 4 MB.

source: Seules les images JPEG, JPG, PNG et GIF sont autorisées.
es: Solo se permiten imágenes JPEG, JPG, PNG y GIF.

source: Fichier image invalide ou corrompu.
es: Archivo de imagen inválido o corrupto.

source: Entrez votre mot de passe
es: Introduce tu contraseña

source: Mot de passe incorrect.
es: Contraseña incorrecta.

source: Statut non valide
es: Estado no válido.

source: Statut mis à jour avec succès
es: Estado actualizado correctamente.

source: Erreur lors du chargement du profil de l'ami.
es: Error al cargar el perfil del amigo.

source: Nom d'utilisateur ou mot de passe invalide
es: Nombre de usuario o contraseña inválidos.

source: Erreur interne du serveur
es: Error interno del servidor.

source: Le 2FA est déjà activé sur votre compte.
es: El 2FA ya está activado en tu cuenta.

source: Une erreur est survenue lors de l'activation de 2FA.
es: Se produjo un error al activar el 2FA.

source: Aucune configuration 2FA en cours.
es: No hay configuración 2FA en curso.

source: Un code est requis.
es: Se requiere un código.

source: Le 2FA a été activé avec succès.
es: El 2FA se ha activado con éxito.

source: Code 2FA invalide.
es: Código 2FA inválido.

source: Une erreur inattendue est survenue.
es: Se produjo un error inesperado.

source: Une erreur est survenue lors du rendu du formulaire.
es: Se produjo un error al renderizar el formulario.

source: Accès non autorisé
es: Acceso no autorizado.

source: 2FA vérifié avec succès. Connexion réussie.
es: 2FA verificado con éxito. Conexión exitosa.

source: Le 2FA n'est pas activé sur votre compte.
es: El 2FA no está activado en tu cuenta.

source: Le 2FA a été désactivé avec succès.
es: El 2FA se ha desactivado con éxito.

source: Refresh token is required
es: Se requiere token de actualización

source: Invalid refresh token
es: Token de actualización inválido

source: Déconnexion réussie.
es: Desconexión exitosa.

source: Nom d'utilisateur de l'ami manquant
es: Falta el nombre de usuario del amigo.

source: Ami introuvable
es: Amigo no encontrado.

source: Vous ne pouvez pas vous envoyer une demande d'ami à vous-même.
es: No puedes enviarte una solicitud de amistad a ti mismo.

source: Vous êtes déjà ami avec cet utilisateur.
es: Ya eres amigo de este usuario.

source: Demande d'ami déjà envoyée.
es: Solicitud de amistad ya enviada.

source: Cet utilisateur vous a déjà envoyé une demande d'ami.
es: Este usuario ya te ha enviado una solicitud de amistad.

source: Demande d'ami envoyée.
es: Solicitud de amistad enviada.

source: Demande d'ami acceptée
es: Solicitud de amistad aceptada.

source: Demande d'ami refusée
es: Solicitud de amistad rechazada.

source: Action non valide
es: Acción no válida.

source: Erreur lors de la gestion de la demande d'ami
es: Error al gestionar la solicitud de amistad.

source: Cet utilisateur n'est pas dans votre liste d'amis.
es: Este usuario no está en tu lista de amigos.

source: Ami supprimé avec succès.
es: Amigo eliminado con éxito.

source: Nom d'utilisateur mis à jour avec succès.
es: Nombre de usuario actualizado con éxito.

source: Votre compte a été supprimé avec succès.
es: Tu cuenta ha sido eliminada con éxito.

source: Mot de passe mis à jour avec succès.
es: Contraseña actualizada con éxito.

source: Avatar mis à jour avec succès.
es: Avatar actualizado con éxito.

source: Une erreur est survenue lors du chargement du profil.
es: Se produjo un error al cargar el perfil.

source: Inscription réussie.
es: Registro exitoso.

source: Erreur interne du serveur.
es: Error interno del servidor.

source: Pas de langage spécifié.
es: No se especificó ningún idioma.

source: Une erreur est survenue lors du changement de langue.
es: Se produjo un error al cambiar el idioma.

source: Les noms des joueurs doivent être uniques.
es: Los nombres de los jugadores deben ser únicos.

source: Méthode non autorisée
es: Método no autorizado.

source: Mode non disponible pour le tactile
es: Modo no disponible para dispositivos táctiles.

source: Les paramètres du jeu sont invalides.
es: Los parámetros del juego son inválidos.

source: La partie en ligne ne peut pas être lancée avec cette API.
es: La partida en línea no puede iniciarse con esta API.

source: La session de jeu spécifiée n'existe pas.
es: La sesión de juego especificada no existe.

source: Paramètres invalides.
es: Parámetros inválidos.

source: Vous n'avez pas encore ajouté d'amis. Ajoutez des amis pour les inviter à jouer.
es: Aún no has añadido amigos. Añade amigos para invitarlos a jugar.

source: Partie en ligne créée avec succès.
es: Partida en línea creada con éxito.

source: Vous n'êtes pas autorisé à inviter pour cette session.
es: No tienes permiso para invitar a esta sesión.

source: Ami introuvable.
es: Amigo no encontrado.

source: Vous ne pouvez pas vous inviter vous-même.
es: No puedes invitarte a ti mismo.

source: Une invitation est déjà en attente pour cette session.
es: Ya hay una invitación pendiente para esta sesión.

source: Invitation envoyée.
es: Invitación enviada.

source: Cette invitation ne référence aucune session.
es: Esta invitación no hace referencia a ninguna sesión.

source: Un second joueur est déjà positionné sur cette session.
es: Ya hay un segundo jugador asignado a esta sesión.

source: Invitation acceptée, session mise à jour.
es: Invitación aceptada, sesión actualizada.

source: Invitation refusée.
es: Invitación rechazada.

source: Vous n'êtes pas autorisé à consulter cette invitation.
es: No tienes permiso para consultar esta invitación.

source: Internal server error
es: Error interno del servidor.

source: Cette session n'est pas une partie en ligne.
es: Esta sesión no es una partida en línea.

source: Vous n'êtes pas autorisé à rejoindre cette partie.
es: No tienes permiso para unirte a esta partida.

source: La partie est déjà lancée ou terminée.
es: La partida ya ha comenzado o ha terminado.

source: Vous n'êtes pas autorisé à accéder à cette partie.
es: No tienes permiso para acceder a esta partida.

source: Rôle utilisateur invalide. Attendu 'left' ou 'right'.
es: Rol de usuario inválido. Se esperaba 'left' ou 'right'.

source: La partie locale ne peut pas être lancée avec cette API.
es: La partida local no puede iniciarse con esta API.

source: La session de jeu n'est pas terminée
es: La sesión de juego no ha terminado.

source: La session de jeu demandée n'existe pas
es: La sesión de juego solicitada no existe.

source: Les résultats pour cette session de jeu ne sont pas disponibles
es: Los resultados para esta sesión de juego no están disponibles.

source: Une erreur est survenue lors de la récupération des résultats
es: Se produjo un error al recuperar los resultados.

source: Formulaire invalide.
es: Formulario inválido.

source: Ce tournoi ne dispose pas de TournamentParameters.
es: Este torneo no cuenta con TournamentParameters.

source: Impossible de créer la finale: gagnants non définis.
es: Imposible crear la final: ganadores no definidos.

source: Cette session est en ligne, impossible de la lancer avec l'API locale.
es: Esta sesión es en línea, imposible iniciarla con la API local.

source: Utilisateur déjà connecté
es: Usuario ya conectado.

source: Utilisateur non authentifié
es: Usuario no autenticado.

source: Authentification partielle requise.
es: Autenticación parcial requerida.

source: En ligne
es: Conectado

source: Hors ligne
es: Desconectado

source: Voir le profil
es: Ver perfil

source: Jouer
es: Jugar

source: Gestion du compte
es: Gestión de cuentas

source: Ajouter un ami
es: Añadir un amigo

source: Ajouter
es: Añadir

source: Amis
es: Amigos

source: Aucun ami pour le moment.
es: Aún no hay amigos.

source: Invitations d'amis
es: Invitaciones de amigos

source: Accepter
es: Aceptar

source: Refuser
es: Rechazar

source: Invitations à jouer
es: Invitaciones a jugar

source: Aucune invitation pour le moment.
es: Aún no hay invitaciones.

source: Déconnexion
es: Desconexión

source: Voir profil
es: Ver perfil

source: Inviter à jouer
es: Invitar a jugar

source: Supprimer
es: Borrar

source: Désactiver l'authentification à deux facteurs
es: Deshabilitar la autenticación de dos factores

source: Entrez le code généré par votre application d'authentification.
es: Ingrese el código generado por su aplicación de autenticación.

source: Code 2FA :
es: Código 2FA :

source: Désactiver 2FA
es: Deshabilitar 2FA

source: Activer l'authentification à deux facteurs
es: Habilitar la autenticación de dos factores

source: QR Code non disponible
es: Código QR no disponible

source: Vérifier
es: Controlar

source: Profil de
es: Perfil de

source: Pseudo :
es: Apodo :

source: Nombre de matchs joués :
es: Número de partidos jugados :

source: Statistiques Générales
es: Estadísticas Generales

source: Victoires :
es: Victorias :

source: Défaites :
es: Derrotas :

source: Meilleur score :
es: Mejor puntuación :

source: Nombre d'amis :
es: Número de amigos :

source: Gestion de Profil
es: Gestión de perfiles

source: Changer de langue
es: Cambiar el idioma

source: Changer d'avatar
es: Cambiar avatar

source: Valider
es: Validar

source: Changer de pseudo
es: Cambiar apodo

source: Changer de mot de passe
es: Cambiar la contraseña

source: Authentification à deux facteurs
es: Autenticación de dos factores

source: Activer 2FA
es: Habilitar 2FA

source: Supprimer le compte
es: Borrar el cuenta

source: Cette action est irréversible. Votre compte sera définitivement supprimé.
es: Esta acción es irreversible. Su cuenta será borrada permanentemente.

source: Supprimer mon compte
es: Borrar mi cuenta

source: Pour des raisons de sécurité, veuillez entrer votre mot de passe pour confirmer la suppression de votre compte.
es: Por razones de seguridad, introduzca su contraseña para confirmar la eliminación de su cuenta.

source: Mot de passe
es: Contraseña olvidada ?

source: Confirmer la suppression
es: Perfil de usuario

source: Connexion
es: Conexión

source: Nom d'utilisateur :
es: Nombre de usuario :

source: Mot de passe :
es: Contraseña :

source: Entrez Code 2FA
es: Introduzca el código 2FA

source: Pour vous connecter, veuillez saisir le code 2FA depuis votre application d'authentification
es: Para iniciar sesión, introduzca el código 2FA desde su aplicación de autenticación

source: Profil Utilisateur
es: Perfil de usuario

source: Inscription
es: Registro

source: Confirmer le mot de passe :
es: Confirmar la contraseña :

source: S'inscrire
es: Registro

source: Menu de Jeu
es: Menú de juego

source: Type de Partie
es: Tipo de Partido

source: Partie Locale
es: Partido local

source: Jouer en ligne
es: Jugar en línea

source: Tournoi Local
es: Torneo Local

source: Résultats du jeu
es: Resultados del juego

source: Vainqueur
es: Ganador

source: Perdant
es: Perdedor

source: Score
es: Puntuación

source: Invitez un ami
es: Invitar a un amigo

source: Inviter
es: Invitar

source: Commencer
es: Continuar

source: Si vous quittez la page, la session actuelle sera supprimée.
es: Si sales de la página, la sesión actual se eliminará.

source: Oui, quitter
es: Sí, salir

source: Non, rester
es: No, quedarme

source: Obstacle en vue, esquive l’imprévu !
es: ¡Obstáculo a la vista, esquiva lo imprevisto!

source: Accélère, file comme l'éclair !
es: ¡Acelera, vuela como un rayo!

source: Ridiculus ! rends le minus !
es: ¡Ridiculus, hazlo minúsculo!

source: Fais les glisser, ils perdont pied !
es: ¡Hazlos deslizar, se tambalearán!

source: Flash Attack, c'es lui qui crack !
es: ¡Flash Attack, y se quedan en shock!

source: Command Reverse, tu les renverses !
es: ¡Command Reverse, y verás su juego al revés!

source: Canon Ball et c'est un goal !
es: ¡Canon Ball y es gol!

source: Chargement
es: Cargando

source: Sélectionner les joueurs
es: Selección los jugadores

source: Nom du Tournoi
es: Nombre del Torneo

source: Nom du Joueur 1
es: Appodo del Jugador 1

source: Joueur 1
es: Jugador 1

source: Nom du Joueur 2
es: Appodo del Jugador 2

source: Joueur 2
es: Jugador 2

source: Nom du Joueur 3
es: Appodo del Jugador 3

source: Joueur 3
es: Jugador 3

source: Nom du Joueur 4
es: Appodo del Jugador 4

source: Joueur 4
es: Jugador 4

source: Lancer le tournoi
es: Lanzar el torneo

source: Pong Championship
es: Campeonato de Pong

source: Le Premier match va commencer
es: El primer partido va a comenzar

source: Le Deuxième match va commencer
es: El segundo partido va a comenzar

source: Place à la Finale
es: ¡A la final!

source: Le grand vainqueur est
es: El gran ganador es

source: Vitesse de la Balle
es: Velocidad de la bola

source: Lente
es: Lenta

source: Normale
es: Normal

source: Rapide
es: Rápida

source: Taille de la Raquette
es: Tamaño de la Raqueta

source: Petite
es: Pequeño

source: Moyenne
es: Mediano

source: Activer les obstacles !
es: ¡Activa los obstáculos!

source: Activer les bonus et malus !
es: ¡Activa los bonus y malus!

source: Voir Tuto Bonus
es: Ver Tuto Bonus

source: **Power-Ups Légendaires !**
es: **Potenciadores legendarios !**
